#include <stdlib.h>
#include <stdio.h>
#include <ctype.h>
#include "../include/utils.h"

#define RED     "\033[1;31m"
#define GREEN   "\033[1;32m"
#define YELLOW  "\033[1;33m"
#define CYAN    "\033[1;36m"
#define RESET   "\033[0m"


void clear_screen() {

	system("clear");
}

int is_number(char *ip) {
	for (int i = 0; ip[i] != '\0'; i++) { 
		if (!isdigit(ip[i])) return 0;
	}

	return 1;
	
}

void banner() {
    printf("\n");

    printf(CYAN);
    printf("██╗██████╗     █████╗ ███╗   ██╗ █████╗ ██╗     ██╗   ██╗███████╗███████╗██████╗\n");
    printf("██║██╔══██╗   ██╔══██╗████╗  ██║██╔══██╗██║     ██║   ██║██╔════╝██╔════╝██╔══██╗\n");
    printf("██║██████╔╝   ███████║██╔██╗ ██║███████║██║     ████████║███████╗█████╗  ██████╔╝\n");
    printf("██║██╔═══╝    ██╔══██║██║╚██╗██║██╔══██║██║        ██   ║╚════██║██╔══╝  ██╔══██╗\n");
    printf("██║██║        ██║  ██║██║ ╚████║██║  ██║███████╗╚██████  ███████║███████╗██║  ██║\n");
    printf("╚═╝╚═╝        ╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝  ╚═╝╚══════╝ ╚═════╝ ╚══════╝╚══════╝╚═╝  ╚═╝\n");
    printf(RESET);

    printf(YELLOW);
    printf("\n\t        >>> IP ANALYZER (IPv4 & IPv6) <<<\n");
    printf(RESET);

    printf(GREEN);
    printf("\t              Built by Kayo Yonas\n");
    printf(RESET);

    printf(RED);
    printf("\t==============================================\n\n");
    printf(RESET);
}
